//
//  Themes.swift
//  Memorize
//
//  Created by Spencer Hurd on 1/11/22.
//

import Foundation


struct Themes {
    
    static var themes = [
        Theme(name: "BATMAN", emojis: ["🦇", "🤡", "♦️", "🥶", "🐈‍⬛", "🐧", "🎭", "🥷🏼", "🌿", "💰", "🐦", "😱", "👊"], pairsOfCards: 13, color: "333333"),
        Theme(name: "TMNT", emojis: ["🐢", "🐀", "🍕", "🧪", "🥷🏼", "⚔️", "🚃", "🏒", "✦"], pairsOfCards: 9, color: "00FF00"),
        Theme(name: "VEHICLES", emojis: ["🚲", "🚂", "🚁", "🚜", "🚕", "🏎", "🚑", "🚓", "🚒", "✈️", "🚀", "⛵️", "🛸", "🛶", "🚌", "🏍", "🛺", "🚠", "🛵", "🚗", "🚚", "🚇", "🛻", "🚝"], pairsOfCards: 24, color: "0000FF"),
        Theme(name: "HOLIDAYS", emojis: ["🎉", "🎊", "🎁", "🎄", "🎃", "🎅🏻", "🎎", "🪔", "🧑🏼‍🎄", "🤶🏾"], pairsOfCards: 10, color: "FF0000"),
        Theme(name: "HARRY POTTER", emojis: ["🧙🏼‍♀️", "🧙🏼", "🧙‍♂️", "🪄", "🚂", "🐍", "🏆", "🧹", "🐈‍⬛", "🐀", "🐺", "🦉", "🦄", "🐉", "🧪", "🕷", "🏰"], pairsOfCards: 17, color: "ABC123"),
        Theme(name: "FLAGS", emojis: ["🏴‍☠️", "🏴", "🇺🇳", "🇦🇺", "🇧🇸", "🇦🇹", "🇨🇷", "🇪🇪", "🇯🇵", "🇹🇹", "🇺🇸", "🇾🇪", "🏴󠁧󠁢󠁳󠁣󠁴󠁿", "🇬🇧", "🇰🇼", "🇳🇴", "🇸🇦", "🇸🇩", "🏴󠁧󠁢󠁷󠁬󠁳󠁿", "🇹🇭", "🇰🇷", "🇷🇺", "🇩🇪", "🇫🇷", "🇨🇳", "🇨🇦", "🇲🇽", "🇵🇭", "🇮🇪", "🏴󠁧󠁢󠁳󠁣󠁴󠁿", "🇪🇸"], pairsOfCards: 28, color: "0F0F0F")
    ]
}
